# Задача: Міні-гра "Вгадай число"
# Створіть ігру, в якій комп'ютер загадує випадкове число, а користувач повинен вгадати його.
# Комп'ютер надає підказки про те, чи число більше або менше від вгаданого, допоки користувач не вгадає число.
# Використайте умовний оператор для визначення, коли гра завершена.

import random

computer_choice = random.randint(1, 50)

print('Привiт! Я загадав число вiд 1 до 50, спробуй вiдгадати!')
user_choice = int(input('Введи число: '))
attempts = 0

while user_choice != computer_choice:
    attempts += 1

    if user_choice > computer_choice:
        print('\nНеправильно! Менше.')
        user_choice = int(input('Введи число: '))
    else:
        print('\nНеправильно! Бiльше.')
        user_choice = int(input('Введи число: '))

print(f'\nБраво, ти вгадав за {attempts} спроб! Саме число {user_choice} я загадував. Дякую за гру. :)')