# Задача: Перевірка парності числа
# Опис: Напишіть програму, яка перевіряє, чи є введене число парним або непарним.

num = int(input('Введiть число для його перевiрки на парнicть: '))

print(num % 2 == 0 and num != 0)