# Змінні: Створіть змінну "x" і присвойте їй значення 10. Потім виведіть її значення на екран.
x = 10
print(x)

print('------' * 3)
# Числа: Обчисліть площу прямокутника з довжиною 5 і шириною 3. Результат виведіть на екран.
a, b = 5, 3
print(a * b)

print('------' * 3)
# Рядки: Створіть рядок "Hello, world!" і виведіть його на екран.
newstr = "Hello, world!"
print(newstr)

print('------' * 3)
# Списки: Створіть список "fruits" з елементами "apple", "banana" і "orange". Виведіть цей список на екран.
fruits = ['apple', 'banana', 'orange']
print(fruits)

print('------' * 3)
# Словники: Створіть словник "ages" з ключами "John" і "Alice" та значеннями 25 і 30 відповідно.
# Виведіть вік Alice на екран.
ages = {
    'John': 25,
    'Alice': 30
}
print(ages['Alice'])

print('------' * 3)
# Кортежі: Створіть кортеж з трьох елементів: 1, 2 та 3. Перевірте, чи є число 2 в цьому кортежі.
nums = (1, 2, 3)
print(2 in nums)

print('------' * 3)
# Множини: Створіть множину "set1" з елементами 1, 2 та 3, і множину "set2" з елементами 3, 4 та 5.
# Об'єднайте ці дві множини і виведіть результат.
set1 = {1, 2, 3}
set2 = {3, 4, 5}

print(set1 | set2)
