import random

# Task 1:
# • Згенеруйте послідовність з 10 цілих чисел з діапазону (0, 50)
# • Згенеруйте випадкове ціле число з діапазону (1, 10) і піднесіть його до степені 3
# • Виведіть суму всіх чисел згенерованої послідовності
# • Знайдіть середнє арифметичне згенерованої послідовності
# • Виконайте цілочисельне ділення між сумою всіх чисел згенерованої послідовності та згенерованим дробовим числом

nums = [random.randint(0, 50) for num in range(10)]
print(f'Згенеруйте послідовність з 10 цілих чисел з діапазону (0, 50) - {nums}')

num_in_pow = random.randint(1, 10) ** 3
print(f'\nЗгенеруйте випадкове ціле число з діапазону (1, 10) і піднесіть його до степені 3 - {num_in_pow}')

print(f'\nВиведіть суму всіх чисел згенерованої послідовності - {sum(nums)}')

average = sum(nums) / len(nums)
print(f'\nЗнайдіть середнє арифметичне згенерованої послідовності - {average}')

rand = random.random()
print(f'\nВиконайте цілочисельне ділення між сумою всіх чисел '
      f'згенерованої послідовності та згенерованим дробовим числом - {sum(nums) // rand}')