import random

# Task 1:
# • Згенеруйте послідовність з 10 цілих чисел з діапазону (0, 50)
# • Згенеруйте випадкове ціле число з діапазону (1, 10) і піднесіть його до степені 3
# • Виведіть суму всіх чисел згенерованої послідовності
# • Знайдіть середнє арифметичне згенерованої послідовності
# • Виконайте цілочисельне ділення між сумою всіх чисел згенерованої послідовності та згенерованим дробовим числом

task1_nums = [random.randint(0, 50) for num in range(10)]
print(f'\nЗгенеруйте послідовність з 10 цілих чисел з діапазону (0, 50) - {task1_nums}')

task1_num_in_pow = random.randint(1, 10) ** 3
print(f'Згенеруйте випадкове ціле число з діапазону (1, 10) і піднесіть його до степені 3 - {task1_num_in_pow}')

print(f'Виведіть суму всіх чисел згенерованої послідовності - {sum(task1_nums)}')

task1_average = sum(task1_nums) / len(task1_nums)
print(f'Знайдіть середнє арифметичне згенерованої послідовності - {task1_average}')

task1_rand = random.random()
print(f'Виконайте цілочисельне ділення між сумою всіх чисел '
      f'згенерованої послідовності та згенерованим дробовим числом - {sum(task1_nums) // task1_rand}')

print('\n====================\n')

# Task 2
# Згенеруйте послідовність з 10 випадкових чисел з діапазону (1, 100) і знайдіть їх середнє арифметичне.
# Згенеруйте послідовність з 15 випадкових чисел з діапазону (-50, 50) і знайдіть суму всіх чисел,
# які діляться на 5 без остачі.

task2_nums = [random.randint(1, 100) for num in range(10)]
task2_average = sum(task2_nums) / len(task2_nums)
print(f'Згенеруйте послідовність з 10 випадкових чисел з діапазону (1, 100) і знайдіть їх середнє арифметичне - {task2_average}')

task2_nums = [random.randint(-50, 50) for num in range(15)]
task2_sum_of_mod5 = sum(num for num in task2_nums if num % 5 == 0)
print(f'Згенеруйте послідовність з 15 випадкових чисел з діапазону (-50, 50) і знайдіть суму всіх чисел, '
      f'які діляться на 5 без остачі - {task2_sum_of_mod5}')